# 1)написати прогу яка вибирає зі введеної строки цифри і виводить їх через кому,
# наприклад:
# st = 'as 23 fdfdg544' введена строка
# 2,3,5,4,4        #вивело в консолі.
st = 'as 23 fdfdg544'

print(', '.join([i for i in st if i.isdigit()]))

# #################################################################################
# 2)написати прогу яка вибирає зі введеної строки числа і виводить їх
# так як вони написані
# наприклад:
#   st = 'as 23 fdfdg544 34' #введена строка
#   23, 544, 34              #вивело в консолі
# #################################################################################
st = 'as 23 fdfdg544 34'

print(', '.join(''.join([i if i.isdigit() else ' ' for i in st]).split()))
#
# list comprehension
#
# 1)есть строка:
# greeting = 'Hello, world'
# записать каждый символ в лист поменяв его на верхний регистр
# пример:
# ['H', 'E', 'L', 'L', 'O', ',', ' ', 'W', 'O', 'R', 'L', 'D']
greeting = 'Hello, world'

print([i.upper() for i in greeting])

# 2) с диапазона от 0-50 записать в лист только не парные числа, при этом возвести их в квадрат
# пример:
# [0, 1, 4, 9, 16, 25, 36, 49, 64, 81, 100, 121, 144, 169, 196, 225, 256, 289, 324, ...]

print([i ** 2 for i in range(50) if i % 2 != 0])


# function
#
# - створити функцію яка виводить ліст
# - створити функцію яка приймає три числа та виводить та повертає найменьше.
# - створити функцію яка приймає три числа та виводить та повертає найбільше.
# - створити функцію яка приймає будь-яку кількість чисел, повертає найменьше, а виводить найбільше
# - створити функцію яка повертає найбільше число з ліста
# - створити функцію яка повертає найменьше число з ліста
# - створити функцію яка приймає ліст чисел та складає значення елементів ліста та повертає його.
# - створити функцію яка приймає ліст чисел та повертає середнє арифметичне його значень.
def func1(arr):
    print(arr)


def min_(a, b, c):
    res = min(a, b, c)
    print(res)
    return res


def max_(a, b, c):
    res = max(a, b, c)
    print(res)
    return res


def min_max(*args):
    print(max(args))
    return min(args)


def max_by_list(l):
    return max(l)


def min_by_list(l):
    return min(l)


def summator(l):
    return sum(l)


def avg(l):
    return sum(l) / len(l)


#
#
#
# #################################################################################################
# 1)Дан лист:
#   list = [22, 3,5,2,8,2,-23, 8,23,5]
#   - найти min число в листе
#   - удалить все дубликаты в листе
#   - заменить каждое четвертое значение на "Х"
# 4) переделать первое задание под меню с помощью цикла
#
# l = [22, 3, 5, 2, 8, 2, -23, 8, 23, 5]
#
# print(min_by_list(l))
# print(list(set(l)))


# def duplicate(l):
#     print(list(set(l)))
#
#
# def func2(l):
#     for i in range(3, len(l), 4):
#         l[i] = 'X'
#     print(l)
#
#
# # func2()
# # print(l)
#
# while True:
#     l = [22, 3, 5, 2, 8, 2, -23, 8, 23, 5]
#     print('1) min')
#     print('2) duplicate')
#     print('3) X')
#     print('9) exit')
#     choice = input('make your choice: ')
#
#     if choice == '1':
#         print(min_by_list(l))
#     elif choice == '2':
#         duplicate(l)
#     elif choice == '3':
#         func2(l)
#     elif choice == '9':
#         break


# 2)вывести на экран пустой квадрат из "*" сторона которого указана в переменой:

def square(n):
    for i in range(n):
        if i == 0 or i == n - 1:
            print('*' * n)
        else:
            print('*' + ' ' * (n - 2) + '*')


square(10)
# 3) вывести табличку умножения с помощью цикла while

i = j = 1

while i < 10:
    j = 1
    while j < 10:
        multi = i * j
        print(multi, end='')
        print('  ' if multi // 10 else '   ', end='')
        j += 1
    i += 1
    print()
